test/cassettes/subscription/valid_create_plan_for_syd.json

[
  {
    "request": {
      "options": [],
      "body": "{\"description\":\"MC subscription\",\"metadata\":null,\"items\":[{\"name\":\"SeeYouDoc MC\",\"type\":\"DIGITAL_PRODUCT\",\"category\":\"syd_mc\",\"url\":null,\"net_unit_amount\":1000,\"quantity\":1}],\"currency\":\"PHP\",\"customer_id\":\"cust-1eecc18d-914a-4f63-8fcf-8b9158d6f1e3\",\"reference_id\":\"9eeddd71-54a7-4fa2-b470-befc5f1far2\",\"recurring_action\":\"PAYMENT\",\"amount\":1000,\"payment_methods\":[],\"schedule\":{\"interval\":\"MONTH\",\"reference_id\":\"9eeddd71-54a7-4fa2-b470-befc5fdfafa2\",\"interval_count\":1,\"total_recurrence\":null,\"anchor_date\":\"2024-01-01T00:00:00+0800\",\"retry_interval\":\"DAY\",\"retry_interval_count\":3,\"total_retry\":2,\"failed_attempt_notifications\":[1,2]},\"immediate_action_type\":\"FULL_AMOUNT\",\"notification_config\":{\"recurring_created\":[\"WHATSAPP\",\"EMAIL\"],\"recurring_succeeded\":[\"WHATSAPP\",\"EMAIL\"],\"recurring_failed\":[\"WHATSAPP\",\"EMAIL\"],\"locale\":\"en\"},\"failed_cycle_action\":\"STOP\",\"payment_link_for_failed_attempt\":true,\"success_return_url\":\"https://syd.com/success\",\"failure_return_url\":\"https://syd.com/failure\"}",
      "url": "https://api.xendit.co/recurring/plans",
      "headers": {
        "accept": "application/json",
        "accept-encoding": "gzip",
        "authorization": "Basic eG5kX2RldmVsb3BtZW50X3JpdkNCemY5SFl4OFU5ZzM2NEh2cVR0OHFLQVBERFI3UVlGZTdwQlBsOGxlZjhoQ0t0QlBYbng3QzFLVTQzOg==",
        "content-type": "application/json",
        "user-agent": "req/0.4.5"
      },
      "method": "post",
      "request_body": ""
    },
    "response": {
      "binary": true,
      "type": "ok",
      "body": "g20AAAMOH4sIAAAAAAAA/5VUXU/jOBT9K6O8LgY7iZuPtyx0h0qUMtBqxCBkOfY1RJs43cRBUyH++1437ZRqR8uMlBf7nvt1znFeg0oHedDBuhbGZCajrCSSq4jEJmQky7QinEPIklSXVOngBLEGOrAKxDY1A9BaJ4zwWCaYJUNSxgklJRjFDTOyCzFJDb1rG+jGHH8iDEAplmqSsVhi4iQiqVGGpGXGeKonhkG0baeGrqvsk5DKVa3F9Jvifj69XmLQyKoGLdRG1XCI3y0XN0eZY1y1g3VBTv00nd9g42tdeqhsxhijFMO9k27oMXg7/bKa3U7vRHG+nC2u/R4dSAd+h5CGEWEhofGSTnI2yTk7nfDoG4KGtf4Y1Ktn0EO9Y7GDXgmWca55lJGJDBWJkyQkWZlIwtOIZlpTMJHCzLXcNGCdaMA9txrnfHg8lAvy1+C3K/6WpNpIvMGscugrC30/Jk3YJDJREmmpOKeRpAnlZZJ6CSvroHuRNaLmi+vl5burvSjsJHCtw/Momp8lyO1Q16iNVc9tJzylI6MxoQy/JaX59vuDppRut3DdRrxrdlHc/+d63zA6NMRwkIc/zCSdg2bthG1dZSolvak8yewkfPzQADH/BQN40Bty0DSgKwTunCvcZu1X/Gt1dSWK+WK1tfj7MXB4a6onr3HdKunVDsAeW30/30Pw9bJY3hU33t/TeTG7Ch7fA/tBKdT5V6AjMT/H4R7oQ4n7yr1gGp3XVevdY5yff+qH8nCDgqo9pa/B0Hmhnp1b9/nZWV3Zv7Eh0fBy+h2srtypas/Wsq5EoiOW8piSOAw5iUsmSZkyRhSTnCWRVBDFP2pjyWK19dn4RvD8eerJxHZ7lr9O/wze/MPxPKCJ0QdDZ8XxQP1G4wTN2Q60++MMHfw/fAfyPkcvjZta2fi2dwD37XDRqk/zc4zvhrmYfZ4tiytxc7u4WJ37SVFweGq9MwOsKho1Tr/n2IITg62cOP5z/TNI6yqHWczvtv9TeF6FwUd0bPEgd90Ah51Uq3ev7u1fLKU43RgGAAA=",
      "headers": {
        "access-control-allow-origin": "*",
        "content-security-policy": "block-all-mixed-content;default-src 'self';base-uri 'self';font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
        "content-type": "application/json; charset=utf-8",
        "date": "Mon, 04 Dec 2023 06:16:52 GMT",
        "etag": "W/\"618-FWCJLPNbfd7wk3C+SEvlIFWRv8g\"",
        "expect-ct": "max-age=0",
        "rate-limit-limit": "3000",
        "rate-limit-remaining": "2997",
        "rate-limit-reset": "7.901",
        "referrer-policy": "no-referrer",
        "request-id": "6042968182489908288",
        "strict-transport-security": "max-age=15552000; includeSubDomains",
        "vary": "Accept-Encoding",
        "x-content-type-options": "nosniff",
        "x-dns-prefetch-control": "off",
        "x-download-options": "noopen",
        "x-frame-options": "SAMEORIGIN",
        "x-permitted-cross-domain-policies": "none",
        "x-xss-protection": "0",
        "connection": "keep-alive",
        "set-cookie": "nlbi_2182539=DYRLb5TlyTj/TNmDtAof7AAAAABq8aAUGAACGMMlebxSsXRQ; path=/; Domain=.xendit.co",
        "x-cdn": "Imperva",
        "content-encoding": "gzip",
        "transfer-encoding": "chunked",
        "x-iinfo": "18-6522969-6218314 pNYy RT(1701670610023 119) q(0 0 0 -1) r(16 16) U6"
      },
      "status_code": 202
    }
  }
]