test/cassettes/subscription/valid_update_plan_for_sub_account.json

[
  {
    "request": {
      "options": [],
      "body": "{\"items\":[{\"name\":\"SeeYouDoc MC\",\"type\":\"DIGITAL_PRODUCT\",\"category\":\"syd_mc\",\"url\":null,\"net_unit_amount\":800,\"quantity\":1}],\"amount\":800}",
      "url": "https://api.xendit.co/recurring/plans/repl_5a113543-6f98-4442-ad53-85e80494266f",
      "headers": {
        "accept": "application/json",
        "accept-encoding": "gzip",
        "authorization": "Basic eG5kX2RldmVsb3BtZW50X3JpdkNCemY5SFl4OFU5ZzM2NEh2cVR0OHFLQVBERFI3UVlGZTdwQlBsOGxlZjhoQ0t0QlBYbng3QzFLVTQzOg==",
        "content-type": "application/json",
        "for-user-id": "655d6ef765c63ff7577f0042",
        "user-agent": "req/0.4.5"
      },
      "method": "patch",
      "request_body": ""
    },
    "response": {
      "binary": false,
      "type": "ok",
      "body": "{\"id\":\"repl_5a113543-6f98-4442-ad53-85e80494266f\",\"reference_id\":\"9eeddd71-54a7-4fa2-b470-befc5f1fa31\",\"customer_id\":\"cust-70e52cb9-6364-4bb0-a670-190495cbd69d\",\"recurring_action\":\"PAYMENT\",\"failed_cycle_action\":\"STOP\",\"recurring_cycle_count\":0,\"currency\":\"PHP\",\"amount\":800,\"status\":\"REQUIRES_ACTION\",\"created\":\"2023-12-04T06:16:42.174Z\",\"updated\":\"2023-12-04T06:41:34.809Z\",\"schedule_id\":\"resc_1b177a3a-13f8-45ce-b39c-d60cefe08b71\",\"payment_methods\":[],\"schedule\":{\"id\":\"resc_1b177a3a-13f8-45ce-b39c-d60cefe08b71\",\"reference_id\":\"9eeddd71-54a7-4fa2-b470-befc5fdfafba\",\"business_id\":\"655d6ef765c63ff7577f0042\",\"interval\":\"MONTH\",\"interval_count\":1,\"total_recurrence\":null,\"anchor_date\":\"2024-01-01T00:00:00+0800\",\"retry_interval\":\"DAY\",\"retry_interval_count\":3,\"total_retry\":2,\"failed_attempt_notifications\":[1,2],\"created\":\"2023-12-04T06:16:42.164Z\",\"updated\":\"2023-12-04T06:16:42.164Z\"},\"immediate_action_type\":\"FULL_AMOUNT\",\"notification_config\":{\"locale\":\"en\",\"recurring_created\":[\"WHATSAPP\",\"EMAIL\"],\"recurring_succeeded\":[\"WHATSAPP\",\"EMAIL\"],\"recurring_failed\":[\"WHATSAPP\",\"EMAIL\"]},\"metadata\":null,\"description\":\"MC subscription\",\"actions\":[{\"url\":\"https://linking-dev.xendit.co/pali_82a2e8fe-a79a-47e8-8ba1-aa0a99ed7bfb\",\"action\":\"AUTH\",\"method\":\"GET\",\"url_type\":\"WEB\"}],\"success_return_url\":\"https://syd.com/success\",\"failure_return_url\":\"https://syd.com/failure\",\"items\":[{\"url\":null,\"name\":\"SeeYouDoc MC\",\"type\":\"DIGITAL_PRODUCT\",\"category\":\"syd_mc\",\"quantity\":1,\"net_unit_amount\":800}],\"payment_link_for_failed_attempt\":true,\"failure_code\":null}",
      "headers": {
        "access-control-allow-origin": "*",
        "content-security-policy": "block-all-mixed-content;default-src 'self';base-uri 'self';font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
        "content-type": "application/json; charset=utf-8",
        "date": "Mon, 04 Dec 2023 06:45:17 GMT",
        "etag": "W/\"616-dG+1cLhh04ADMMdNZ90q+D6+xtg\"",
        "expect-ct": "max-age=0",
        "rate-limit-limit": "3000",
        "rate-limit-remaining": "2999",
        "rate-limit-reset": "60",
        "referrer-policy": "no-referrer",
        "request-id": "8504191890083774633",
        "strict-transport-security": "max-age=15552000; includeSubDomains",
        "vary": "Accept-Encoding",
        "x-content-type-options": "nosniff",
        "x-dns-prefetch-control": "off",
        "x-download-options": "noopen",
        "x-frame-options": "SAMEORIGIN",
        "x-permitted-cross-domain-policies": "none",
        "x-xss-protection": "0",
        "content-length": "1558",
        "connection": "keep-alive",
        "set-cookie": "nlbi_2182539=doyDPoulEl4g2kqEtAof7AAAAAAan6E4RaJsahuZmObWT3Jj; path=/; Domain=.xendit.co",
        "x-cdn": "Imperva",
        "x-iinfo": "9-932905-932908 nNNY RT(1701672316031 92) q(0 0 0 -1) r(0 5) U6"
      },
      "status_code": 200
    }
  }
]