test/cassettes/subscription/valid_update_plan_for_syd.json

[
  {
    "request": {
      "options": [],
      "body": "{\"items\":[{\"name\":\"SeeYouDoc MC\",\"type\":\"DIGITAL_PRODUCT\",\"category\":\"syd_mc\",\"url\":null,\"net_unit_amount\":800,\"quantity\":1}],\"amount\":800}",
      "url": "https://api.xendit.co/recurring/plans/repl_ff9f901b-a5c3-4f21-99dc-55e2178db0cd",
      "headers": {
        "accept": "application/json",
        "accept-encoding": "gzip",
        "authorization": "Basic eG5kX2RldmVsb3BtZW50X3JpdkNCemY5SFl4OFU5ZzM2NEh2cVR0OHFLQVBERFI3UVlGZTdwQlBsOGxlZjhoQ0t0QlBYbng3QzFLVTQzOg==",
        "content-type": "application/json",
        "user-agent": "req/0.4.5"
      },
      "method": "patch",
      "request_body": ""
    },
    "response": {
      "binary": false,
      "type": "ok",
      "body": "{\"id\":\"repl_ff9f901b-a5c3-4f21-99dc-55e2178db0cd\",\"reference_id\":\"9eeddd71-54a7-4fa2-b470-befc5f1far2\",\"customer_id\":\"cust-1eecc18d-914a-4f63-8fcf-8b9158d6f1e3\",\"recurring_action\":\"PAYMENT\",\"failed_cycle_action\":\"STOP\",\"recurring_cycle_count\":0,\"currency\":\"PHP\",\"amount\":800,\"status\":\"REQUIRES_ACTION\",\"created\":\"2023-12-04T06:16:51.653Z\",\"updated\":\"2023-12-04T06:36:31.738Z\",\"schedule_id\":\"resc_1955d539-6a2c-4772-9b7a-58309dd0ef3c\",\"payment_methods\":[],\"schedule\":{\"id\":\"resc_1955d539-6a2c-4772-9b7a-58309dd0ef3c\",\"reference_id\":\"9eeddd71-54a7-4fa2-b470-befc5fdfafa2\",\"business_id\":\"6163f373dac5503a0705b783\",\"interval\":\"MONTH\",\"interval_count\":1,\"total_recurrence\":null,\"anchor_date\":\"2024-01-01T00:00:00+0800\",\"retry_interval\":\"DAY\",\"retry_interval_count\":3,\"total_retry\":2,\"failed_attempt_notifications\":[1,2],\"created\":\"2023-12-04T06:16:51.645Z\",\"updated\":\"2023-12-04T06:16:51.645Z\"},\"immediate_action_type\":\"FULL_AMOUNT\",\"notification_config\":{\"locale\":\"en\",\"recurring_created\":[\"WHATSAPP\",\"EMAIL\"],\"recurring_succeeded\":[\"WHATSAPP\",\"EMAIL\"],\"recurring_failed\":[\"WHATSAPP\",\"EMAIL\"]},\"metadata\":null,\"description\":\"MC subscription\",\"actions\":[{\"url\":\"https://linking-dev.xendit.co/pali_7d318540-4225-4b1a-b811-c1a5173ace34\",\"action\":\"AUTH\",\"method\":\"GET\",\"url_type\":\"WEB\"}],\"success_return_url\":\"https://syd.com/success\",\"failure_return_url\":\"https://syd.com/failure\",\"items\":[{\"url\":null,\"name\":\"SeeYouDoc MC\",\"type\":\"DIGITAL_PRODUCT\",\"category\":\"syd_mc\",\"quantity\":1,\"net_unit_amount\":800}],\"payment_link_for_failed_attempt\":true,\"failure_code\":null}",
      "headers": {
        "access-control-allow-origin": "*",
        "content-security-policy": "block-all-mixed-content;default-src 'self';base-uri 'self';font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
        "content-type": "application/json; charset=utf-8",
        "date": "Mon, 04 Dec 2023 06:39:29 GMT",
        "etag": "W/\"616-ahFj6rgHmcRNC3GR7rKP535r/BQ\"",
        "expect-ct": "max-age=0",
        "rate-limit-limit": "3000",
        "rate-limit-remaining": "2999",
        "rate-limit-reset": "60",
        "referrer-policy": "no-referrer",
        "request-id": "85511406898669856",
        "strict-transport-security": "max-age=15552000; includeSubDomains",
        "vary": "Accept-Encoding",
        "x-content-type-options": "nosniff",
        "x-dns-prefetch-control": "off",
        "x-download-options": "noopen",
        "x-frame-options": "SAMEORIGIN",
        "x-permitted-cross-domain-policies": "none",
        "x-xss-protection": "0",
        "content-length": "1558",
        "connection": "keep-alive",
        "set-cookie": "nlbi_2182539=42ipMNH5LA9jHS+WtAof7AAAAACJGoCME3Ar+ymeJqGjFTH2; path=/; Domain=.xendit.co",
        "x-cdn": "Imperva",
        "x-iinfo": "18-6819029-6759040 pNNy RT(1701671968369 104) q(0 0 0 -1) r(5 5) U6"
      },
      "status_code": 200
    }
  }
]